lvx/base/Documents/бит_му_ЗачетАвансовПоЛизингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ЗачетАвансовПоЛизингу</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>Договор контрагента</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.бит_ДоговорыКонтрагентов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаВзаиморасчетов</Name>
							<Comment>Валюта взаиморасчетов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Comment>Сумма аванса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаАванса</Name>
							<Comment>Сумма аванса в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбязательств</Name>
							<Comment>Сумма краткосрочных/долгосрочных обязательств</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаОбязательств</Name>
							<Comment>Сумма краткосрочных/долгосрочных обязательств в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПогашения</Name>
							<Comment>Сумма погашения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаПогашения</Name>
							<Comment>Сумма погашения в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаАвансов</Name>
							<Comment>Счет учета авансов</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаОбязательств</Name>
							<Comment>Счет учета краткосрочных/долгосрочных обязательств</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПроцентов</Name>
							<Comment>Сумма начисленных процентов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаПроцентов</Name>
							<Comment>Вал. сумма начисленных процентов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПогашенияПроцентов</Name>
							<Comment>Сумма погашения процентов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаПогашенияПроцентов</Name>
							<Comment>Сумма погашения процентов  в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаПроцентов</Name>
							<Comment>Счет учета процентов</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_му_ЗачетАвансовПоЛизингу/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция готовит таблицы документа для проведения.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  СтруктураТаблиц - Структура.
// 
Функция ПодготовитьТаблицыДокумента(Ссылка)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.Ссылка КАК Ссылка,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.НомерСтроки КАК НомерСтроки,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.Контрагент КАК Контрагент,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.КурсАванса КАК КурсАванса,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаАванса КАК СуммаАванса,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаАванса КАК ВалютнаяСуммаАванса,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаОбязательств КАК СуммаОбязательств,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаОбязательств КАК ВалютнаяСуммаОбязательств,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаПогашения КАК СуммаПогашения,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаПогашения КАК ВалютнаяСуммаПогашения,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СчетУчетаАвансов КАК СчетУчетаАвансов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СчетУчетаОбязательств КАК СчетУчетаОбязательств,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СчетУчетаПроцентов КАК СчетУчетаПроцентов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаПроцентов КАК СуммаПроцентов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаПроцентов КАК ВалютнаяСуммаПроцентов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.СуммаПогашенияПроцентов КАК СуммаПогашенияПроцентов,
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.ВалютнаяСуммаПогашенияПроцентов КАК ВалютнаяСуммаПогашенияПроцентов
	|ИЗ
	|	Документ.бит_му_ЗачетАвансовПоЛизингу.ДанныеРаспределения КАК ЗачетАвансовПоЛизингуДанныеРаспределения
	|ГДЕ
	|	ЗачетАвансовПоЛизингуДанныеРаспределения.Ссылка = &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДанныеРаспределения = РезультатЗапроса.Выгрузить();
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ДанныеРаспределения", ТаблицаДанныеРаспределения);
	
	Возврат СтруктураТаблиц;
	
КонецФункции

#КонецОбласти

#КонецЕсли
